In [8]:
import numpy as np
import pandas as pd

In [9]:
data = np.random.randn(4,3)

In [10]:
data

array([[-1.15915478, -0.66889272, -1.14421004],
       [ 0.38370961,  0.80289179, -0.65191931],
       [-0.29796037,  1.00488041,  1.75229634],
       [ 1.9212176 ,  0.11163037,  1.0985139 ]])

In [11]:
dataFrame = pd.DataFrame(data)

In [12]:
dataFrame

          0         1         2
0 -1.159155 -0.668893 -1.144210
1  0.383710  0.802892 -0.651919
2 -0.297960  1.004880  1.752296
3  1.921218  0.111630  1.098514

In [14]:
yenidataFrame = pd.DataFrame(data,index = ["Ali","Veli","Zeynep",
                                          "Aslı"],columns = ["maas",
                                                           "yaş","saat"])

In [16]:
yenidataFrame

            maas       yaş      saat
Ali    -1.159155 -0.668893 -1.144210
Veli    0.383710  0.802892 -0.651919
Zeynep -0.297960  1.004880  1.752296
Aslı    1.921218  0.111630  1.098514

In [17]:
yenidataFrame["maas"]

Ali      -1.159155
Veli      0.383710
Zeynep   -0.297960
Aslı      1.921218
Name: maas, dtype: float64

In [18]:
yenidataFrame.loc["Ali"]

maas   -1.159155
yaş    -0.668893
saat   -1.144210
Name: Ali, dtype: float64

In [19]:
yenidataFrame.iloc[1]

maas    0.383710
yaş     0.802892
saat   -0.651919
Name: Veli, dtype: float64

In [20]:
yenidataFrame

            maas       yaş      saat
Ali    -1.159155 -0.668893 -1.144210
Veli    0.383710  0.802892 -0.651919
Zeynep -0.297960  1.004880  1.752296
Aslı    1.921218  0.111630  1.098514

In [33]:
yenidataFrame["emeklilik yası"] = yenidataFrame["yaş"]*3

In [34]:
yenidataFrame

            maas       yaş      saat  emeklilik yası
Ali    -1.159155 -0.668893 -1.144210       -2.006678
Veli    0.383710  0.802892 -0.651919        2.408675
Zeynep -0.297960  1.004880  1.752296        3.014641
Aslı    1.921218  0.111630  1.098514        0.334891

In [38]:
yenidataFrame.drop("emeklilik yası",axis = 1)

            maas       yaş      saat
Ali    -1.159155 -0.668893 -1.144210
Veli    0.383710  0.802892 -0.651919
Zeynep -0.297960  1.004880  1.752296
Aslı    1.921218  0.111630  1.098514

In [39]:
yenidataFrame.drop.drop("Aslı",axis = 0)

            maas       yaş      saat  emeklilik yası
Ali    -1.159155 -0.668893 -1.144210       -2.006678
Veli    0.383710  0.802892 -0.651919        2.408675
Zeynep -0.297960  1.004880  1.752296        3.014641

In [40]:
yenidataFrame

            maas       yaş      saat  emeklilik yası
Ali    -1.159155 -0.668893 -1.144210       -2.006678
Veli    0.383710  0.802892 -0.651919        2.408675
Zeynep -0.297960  1.004880  1.752296        3.014641
Aslı    1.921218  0.111630  1.098514        0.334891

In [41]:
 yenidataFrame.drop("emeklilik yası",axis = 1,inplace = True)

In [42]:
yenidataFrame

            maas       yaş      saat
Ali    -1.159155 -0.668893 -1.144210
Veli    0.383710  0.802892 -0.651919
Zeynep -0.297960  1.004880  1.752296
Aslı    1.921218  0.111630  1.098514

In [44]:
yenidataFrame.loc["Ali"]["yaş"]

-0.6688927244921778

In [46]:
yenidataFrame.loc["Ali","yaş"]

-0.6688927244921778

In [47]:
yenidataFrame

            maas       yaş      saat
Ali    -1.159155 -0.668893 -1.144210
Veli    0.383710  0.802892 -0.651919
Zeynep -0.297960  1.004880  1.752296
Aslı    1.921218  0.111630  1.098514

In [50]:
booleanFrame = yenidataFrame  <0

In [53]:
booleanFrame

         maas    yaş   saat
Ali      True   True   True
Veli    False  False   True
Zeynep   True  False  False
Aslı    False  False  False

In [60]:
yenidataFrame[booleanFrame]

            maas       yaş      saat
Ali    -1.159155 -0.668893 -1.144210
Veli         NaN       NaN -0.651919
Zeynep -0.297960       NaN       NaN
Aslı         NaN       NaN       NaN

In [61]:
yenidataFrame[yenidataFrame["yaş"] > 0]

            maas       yaş      saat
Veli    0.383710  0.802892 -0.651919
Zeynep -0.297960  1.004880  1.752296
Aslı    1.921218  0.111630  1.098514

# index Değişimi

In [62]:
yenidataFrame.reset_index()

    index      maas       yaş      saat
0     Ali -1.159155 -0.668893 -1.144210
1    Veli  0.383710  0.802892 -0.651919
2  Zeynep -0.297960  1.004880  1.752296
3    Aslı  1.921218  0.111630  1.098514

In [63]:
yenidataFrame

            maas       yaş      saat
Ali    -1.159155 -0.668893 -1.144210
Veli    0.383710  0.802892 -0.651919
Zeynep -0.297960  1.004880  1.752296
Aslı    1.921218  0.111630  1.098514

In [66]:
yeniindex = ["mahmut","memet","aysel","burak"]

In [67]:
yenidataFrame["yeni index"] = yeniindex

In [68]:
yenidataFrame

            maas       yaş      saat yeni index
Ali    -1.159155 -0.668893 -1.144210     mahmut
Veli    0.383710  0.802892 -0.651919      memet
Zeynep -0.297960  1.004880  1.752296      aysel
Aslı    1.921218  0.111630  1.098514      burak

In [69]:
yenidataFrame.set_index("yeni index")

                maas       yaş      saat
yeni index
mahmut     -1.159155 -0.668893 -1.144210
memet       0.383710  0.802892 -0.651919
aysel      -0.297960  1.004880  1.752296
burak       1.921218  0.111630  1.098514

In [70]:
yenidataFrame

            maas       yaş      saat yeni index
Ali    -1.159155 -0.668893 -1.144210     mahmut
Veli    0.383710  0.802892 -0.651919      memet
Zeynep -0.297960  1.004880  1.752296      aysel
Aslı    1.921218  0.111630  1.098514      burak

In [71]:
yenidataFrame.set_index("yeni index", inplace = True)

In [72]:
yenidataFrame

                maas       yaş      saat
yeni index
mahmut     -1.159155 -0.668893 -1.144210
memet       0.383710  0.802892 -0.651919
aysel      -0.297960  1.004880  1.752296
burak       1.921218  0.111630  1.098514

# çoklu index

In [73]:
ilkindex = ["gül","gül","gül","gezer","gezer","gezer"]

In [74]:
icindex = ["memet","aysel","burak","eda","enes","nihat"]

In [75]:
birlesmisindex = list(zip(ilkindex,icindex))

In [76]:
birlesmisindex

[('gül', 'memet'),
 ('gül', 'aysel'),
 ('gül', 'burak'),
 ('gezer', 'eda'),
 ('gezer', 'enes'),
 ('gezer', 'nihat')]

In [77]:
birlesmisindex = pd.MultiIndex.from_tuples(birlesmisindex)

In [78]:
birlesmisindex

MultiIndex([(  'gül', 'memet'),
            (  'gül', 'aysel'),
            (  'gül', 'burak'),
            ('gezer',   'eda'),
            ('gezer',  'enes'),
            ('gezer', 'nihat')],
           )